[
    {
        "title": "Dear Sophie: How do we craft a strong H-1B petition? If I’m not selected, what are my options?",
        "description": "Thank you for asking the questions that are on the minds of many H-1B first-timers. Don’t worry! Several options exist if you’re not selected.",
        "content": "More posts by this contributor\r\nHere’s another edition of Dear Sophie, the advice column that answers immigration-related questions about working at technology companies.\r\nYour questions are vital to the spread of knowledge that allows people all over the wor… [+8133 chars]"
    },
    {
        "title": "Policewoman, teacher and nurse among victims of Canada mass shooting",
        "description": "Families across Canada struggled on Monday to come to grips with the deadliest shooting rampage in the country's history, in which the victims included a veteran police officer, a teacher and a nurse.",
        "content": "(Reuters) - Families across Canada struggled on Monday to come to grips with the deadliest shooting rampage in the country’s history, in which the victims included a veteran police officer, a teacher and a nurse. \r\nConstable Heidi Stevenson had spent about 23… [+2830 chars]"
    },
    {
        "title": "Coronavirus timeline: How the disease spread across the globe - CNET",
        "description": "COVID-19 was first detected in December last year and has now spread to over 160 countries worldwide. Here's how the pandemic unfolded.",
        "content": "Health workers screen a patient for coronavirus on March 18 at a drive-through testing site in Arlington, Virginia.\r\nDrew Angerer/Getty Images\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nCOVID-19, the … [+80954 chars]"
    },
    {
        "title": "Meghan and Harry reportedly just moved to LA. Here are the private schools for the ultrawealthy where they could send baby Archie, from a $40,000-per-year California prep school to an academy where Justin Trudeau used to teach.",
        "description": "Pool/Samir Hussein via Getty Images The Duke and Duchess of Sussex will give up every aspect of royal life when they officially resign in April. Its been rumored that they relocated to Vancouver island, but they reportedly moved to LA before Canada's coronavi…",
        "content": "None"
    },
    {
        "title": "The constant cuts to the US healthcare safety net have made the coronavirus more devastating. We can't make the same mistake again.",
        "description": "U.S. Navy/Chief Mass Communication Specialist Barry Riley/Handout via Reuters The Trump administration has rolled back food and health programs under the guise of reducing costs. The coronavirus pandemic exposed the problems with these cuts. But the programs,…",
        "content": "Business Insider\r\nHealth is the cornerstone of a person's livelihood, and without it, all else suffers. Work hours are lost; healthcare costs go up; the means for securing necessities like rent, food, and clothing diminishes; and ultimately the economy suffer… [+6072 chars]"
    },
    {
        "title": "98% of this union's 307,000 members — mostly women and people of color — are out of work because of the coronavirus. Here's how its leadership is scrambling to support them",
        "description": "Diego Cervo/Shutterstock Unite Here is a private sector labor union in Canada and the US, and the majority of its members are women and people of color who work in the restaurant, food service, and hotel industries. Since the COVID-19 has decimated hospitalit…",
        "content": "Unite Here was a rare union success story. But then the coronavirus decimated the restaurant, food service, and hotel industries, where most of its 307,000 members work. \"We're fighting for our survival,\" its president told ProPublica.\r\nLast June, D. Taylor, … [+9578 chars]"
    },
    {
        "title": "'Follow the hot hands': HSBC lays out a coronavirus-investing playbook focused on funds that have beaten the market for years — and shares the top stocks in each",
        "description": "HSBC strategist Alastair Pinder identified a group of hedge funds that topped a global benchmark for three consecutive years and have also outperformed during the last few tumultuous weeks. Pinder says there's evidence funds with that kind of track record wil…",
        "content": "For years, sports fans and investors have debated whether there is really such a thing as a \"hot hand.\" That is, if a player or investor is performing very well, are they likely to keep up the streak?\r\nAlastair Pinder, global equity strategist at HSBC, says h… [+2914 chars]"
    },
    {
        "title": "The Queen at 94: The most important photo from every single year of her remarkable life",
        "description": "<ul>\n<li>Queen Elizabeth II celebrates her 94th birthday on April 21, 2020.</li>\n<li>This year's celebrations will be slightly different as the monarch and her husband Prince Philip are on lockdown at Windsor Castle instead of taking part in Her Majesty's usu…",
        "content": "Our Royal Insider Facebook group is the best place for up-to-date news and announcements about the British royal family, direct from Insider's royal reporters. Join here."
    },
    {
        "title": "18 Freelance Sites to Find Your Next Gig",
        "description": "Not all job boards are created equal, but some are capable of getting you where you want to go.",
        "content": "April\r\n17, 2020\r\n10 min read\r\nOpinions expressed by Entrepreneur contributors are their own.\r\nConsider this: Freelancers are expected to become the U.S. workforce majority in the near future. That means we can expect to see more and more freelancing job board… [+10340 chars]"
    },
    {
        "title": "13 more COVID-19 deaths and 309 more cases confirmed in Ontario - CTV News",
        "description": "13 more COVID-19 deaths and 309 more cases confirmed in Ontario CTV News Global National: April 5, 2020 | COVID-19 cases surge in Ontario, Quebec Global News COVID-19 live: Doug Ford says U.S. blocked delivery of three million face masks to Canada National Po…",
        "content": "TORONTO -- \r\nOntario health officials have confirmed 309 new cases of COVID-19 in the province, including 13 more deaths.\r\nThe new patients announced on Monday morning bring the total number of confirmed cases of the novel coronavirus in Ontario to 4,347, inc… [+2554 chars]"
    },
    {
        "title": "'Can't sugar coat it': Pandemic preparedness doc braces for patient surge - Calgary Herald",
        "description": "'Can't sugar coat it': Pandemic preparedness doc braces for patient surge Calgary Herald Youngest COVID-19 death so far in Canada is Alberta woman in her 20s Global News One more death, 98 new cases of COVID-19 in Alberta CBC.ca Alberta’s government is using …",
        "content": "When shes tending to medical emergency cases, the woman heading up the Calgary zones pandemic preparedness is warily gauging its ability to cope with a coming COVID-19 patient surge.\r\nCalgary remains Albertas hotbed for the spread of the novel coronavirus, wi… [+679 chars]"
    },
    {
        "title": "Zoom shares slip over security concerns, rising competition - Yahoo Canada Finance",
        "description": "Zoom shares slip over security concerns, rising competition Yahoo Canada Finance Taiwan joins Canada in banning Zoom for government video conferencing CBC.ca Skype introduces 'Meet Now' video calls to lure users away from Zoom TechSpot Yes, Zoom 'Messed Up,' …",
        "content": "(Reuters) - Shares of Zoom Video Communications Inc &lt;ZM.O&gt; fell 8% on Monday, adding to their sharp declines in the past few days, as the video conferencing app battles privacy concerns and increased competition from deep-pocketed rivals.\r\nThe stock had… [+2431 chars]"
    },
    {
        "title": "COVID-19 Live: 69 new cases, three more deaths in Alberta | House of Commons looks to have virtual sittings - Calgary Herald",
        "description": "COVID-19 Live: 69 new cases, three more deaths in Alberta | House of Commons looks to have virtual sittings Calgary Herald 69 new cases of COVID-19 reported in Alberta, 3 more deaths CTV News Edmonton Youngest COVID-19 death so far in Canada is Alberta woman …",
        "content": "Usually at this time of year, the group of Ghostbusters cosplayers would be preparing for appearances at big events like the Calgary Expo, where they would be raising money $12,478.65 last year for the Alberta Childrens Hospital in Calgary and the Stollery Ch… [+542 chars]"
    },
    {
        "title": "Alberta reports another 98 cases of COVID-19, suggests benefits to wearing masks in public - Calgary Herald",
        "description": "Alberta reports another 98 cases of COVID-19, suggests benefits to wearing masks in public Calgary Herald Youngest COVID-19 death so far in Canada is Alberta woman in her 20s Global News 69 new cases of COVID-19 reported in Alberta, 3 more deaths CTV News Edm…",
        "content": "The provinces chief medical officer of health reported another 98 cases and a single death from COVID-19 during Mondays update.\r\nThere are now 1,348 cases in the province, which includes 361 confirmed recoveries, according to Dr. Deena Hinshaw. With over 200 … [+776 chars]"
    },
    {
        "title": "What the Spanish Flu may teach us about COVID-19 - CityNews Vancouver",
        "description": "What the Spanish Flu may teach us about COVID-19 CityNews Vancouver What the Spanish Flu Pandemic of 1918 Tells Us About the Stock Market The Motley Fool Canada How Revelstoke handled the Spanish flu Kelowna Capital News The geopolitical battle for the COVID-…",
        "content": "VANCOUVER (NEWS 1130) — “I think there are a lot of lessons from a hundred years ago,” says Neil Orford, co-founder of Defining Moments Canada, an online education resource for students and teachers.\r\nHe says there are many parallels between the flu pandemic … [+1493 chars]"
    },
    {
        "title": "The COVID-19 pandemic will create winners and losers - The Globe and Mail",
        "description": "The COVID-19 pandemic will create winners and losers The Globe and Mail All businesses seeing 30% drop in revenue due to pandemic will be eligible for 75% wage subsidies: Trudeau CBC.ca Here’s who’s eligible and how to apply for Canada’s coronavirus wage subs…",
        "content": "Provincial governments spend about twice as much on health care a health-care worker seen here in Vancouver on March 30, 2020 as on education. When this is all over, that gap is likely to widen.\r\nJONATHAN HAYWARD/The Canadian Press\r\nWhen the pandemic subsides… [+5296 chars]"
    },
    {
        "title": "Marvel, Lucasfilm, Pixar, Other Disney Units Hit with Furloughs - Animation World Network",
        "description": "Marvel, Lucasfilm, Pixar, Other Disney Units Hit with Furloughs Animation World Network More Disney workers reach deals on coronavirus furloughs Yahoo Canada Finance Walt Disney: His 10 Most Inspiring Quotes | ScreenRant Screen Rant Get a week of free Disney …",
        "content": "The Walt Disney Company today has sent out temporary dismissal notices to staff members across the organization, according to reports on both Variety and The Hollywood Reporter and confirmed by a Disney spokesperson. An undetermined number of employees at Dis… [+3851 chars]"
    },
    {
        "title": "Watch live: Ontario premier to make COVID-19-related announcement - CTV News",
        "description": "Watch live: Ontario premier to make COVID-19-related announcement CTV News Coronavirus: Ontario launches online portal to recruit health-care workers Global News Coronavirus: Latest developments in the Greater Toronto Area on April 7 Global News First Ontario…",
        "content": "TORONTO -- \r\nThe Ontario government is calling for all hands on deck and is asking anyone with a medical background to step forward in an effort to fight the COVID-19 pandemic.\r\nSpeaking at Queens Park on Tuesday, alongside Minister of Health Christine Elliot… [+4998 chars]"
    },
    {
        "title": "Students giving Google Classroom bad reviews in bid to end homework - Toronto Sun",
        "description": "Students giving Google Classroom bad reviews in bid to end homework Toronto Sun Google Phone app can now be installed on some non-Pixel phones from the Play Store XDA Developers View Full coverage on Google News",
        "content": "Some rebellious students are taking their dislike of homework to another level.\r\nWhile schools remain closed across Canada due to the coronavirus pandemic, electronic learning has begun recently for homebound students through applications like Google Classroo… [+1914 chars]"
    },
    {
        "title": "Jason Kenney says there’s 'a special place in hell’ for hoarders, scammers during pandemic - The Globe and Mail",
        "description": "Jason Kenney says there’s 'a special place in hell’ for hoarders, scammers during pandemic The Globe and Mail Five charts showing the spread of COVID-19 in Alberta and Canada CTV News Oil and gas companies taking steps to keep employees safe from COVID-19 Glo…",
        "content": "Alberta Premier Jason Kenney updates media on measures taken to help with COVID-19, in Edmonton on March 20, 2020. Kenney says officials are continuing to hear about cases of hoarding food and other vital supplies.\r\nJASON FRANSON/The Canadian Press\r\nAlberta P… [+3558 chars]"
    },
    {
        "title": "Google Maps Now Shows Nearby Takeout and Delivery Options",
        "description": "Ordering in or picking up dinner? Google Maps has been updated with two search filters that highlight nearby takeout and delivery options. The new search options are officially available on Android and iOS in the US, Canada and France, but users in other coun…",
        "content": "Ordering in or picking up dinner? Google Maps has been updated with two search filters that highlight nearby takeout and delivery options. The new search options are officially available on Android and iOS in the US, Canada and France, but users in other coun… [+1283 chars]"
    },
    {
        "title": "How You Think Airlines Should Change, Post-Pandemic",
        "description": "At the beginning of this week we asked you what you think airlines should change, once the pandemic is over and life returns to something close to normal. We received over 60 comments, with many of you noting that it’s unlikely airlines will change (at least …",
        "content": "At the beginning of this week we asked you what you think airlines should change, once the pandemic is over and life returns to something close to normal. We received over 60 comments, with many of you noting that its unlikely airlines will change (at least f… [+5341 chars]"
    },
    {
        "title": "Everything You Need to Know About Quibi",
        "description": "Quibi, a new streaming service from Jeffery Katzenberg, founder and CEO of Dreamworks, officially launched today. Unlike most streaming services that are meant to be watched on your television, Quibi is designed to be watched primarily on your mobile phone. R…",
        "content": "Quibi, a new streaming service from Jeffery Katzenberg, founder and CEO of Dreamworks, officially launched today. Unlike most streaming services that are meant to be watched on your television, Quibi is designed to be watched primarily on your mobile phone.\r\n… [+3399 chars]"
    },
    {
        "title": "Google Maps now highlights restaurants with delivery options",
        "description": "Google Maps is still useful for grabbing a bite to eat even in the midst of widespread COVID-19 lockdowns, it seems. Google has rolled out updates to its Android and iOS apps that highlight restaurants with delivery (and, for some reason, takeout) options -- …",
        "content": "The feature is available now in at least the US, Canada and France, and likely other parts of the world as well. Yes, this Maps tweak is arguably a cruel reminder of all the places you can't go while you're staying at home during the pandemic. Look at it this… [+129 chars]"
    },
    {
        "title": "Amazon #AtHome brings free content to Fire TV and Fire Tablet devices",
        "description": "To help keep users entertained while they stay home during the COVID-19 pandemic, Amazon is bringing curated content from over 100 partners to a new #AtHome section on its Fire TV and Fire Tablet devices in the US. Fire users will have access to free TV shows…",
        "content": "In addition to the News app on Fire TV, #AtHome will curate the latest COVID-19 updates from ABC News, CBS News, Fox News, NBC News and more. NBC News will stream a kids edition of the “Nightly News with Lester Holt” twice a week. There will be plenty of othe… [+349 chars]"
    },
    {
        "title": "Amazon extends return window amid coronavirus pandemic",
        "description": "Amazon is temporarily extending its return policy window to help its customers during the coronavirus crisis. If you live in the US or Canada, you now have until May 31st to return any products you buy between now and April 30th through Amazon or one of the c…",
        "content": "Amazon is temporarily extending its return policy window to help its customers during the coronavirus crisis. If you live in the US or Canada, you now have until May 31st to return any products you buy between now and April 30th through Amazon or one of the c… [+324 chars]"
    },
    {
        "title": "Razer's updated Blade Stealth gets a faster display and GPU",
        "description": "Last year’s 13.3-inch Razer Blade Stealth was one of the first truly powerful ultrabooks with NVIDIA GTX 1650 graphics and a tiny 2.5 pound size, but it still had a few shortcomings. Razer has now addressed many of those the new Razer Blade Stealth 2020 model…",
        "content": "The design remains unchanged, with tiny 4.9 mm bezels, USB 3.0 ports, a USB Type C Thunderbolt port and a headphone jack. As before, it can be paired with a Razer Core X eGPU equipped with any GPU for greater gaming speeds. The weight has increased a bit to 3… [+522 chars]"
    },
    {
        "title": "Chinese digital spying is becoming more aggressive, researchers say",
        "description": "FireEye, a US cybersecurity firm, says that it has seen a concerning spike in activity from what appears to be a Chinese hacking group called APT41. The attacks are being deployed against companies in the US, Canada, the UK and several other counties, which i…",
        "content": "FireEye, a US cybersecurity firm, says that it has seen a concerning spike in activity from what appears to be a Chinese hacking group called APT41. The attacks are being deployed against companies in the US, Canada, the UK and several other counties, which i… [+529 chars]"
    },
    {
        "title": "Roku adds voice command support for Spanish in the US and Mexico",
        "description": "For all their many strengths, Roku devices have not had the best voice control features. If that's important to you, your best bet has frequently been Amazon's Fire TV devices. However, with its latest software update, Roku is trying to change that with more …",
        "content": "Spanish speakers in the US and Mexico have the most to look forward to with the new software adding voice support for their language. If you speak Spanish, you'll be able to ask your Roku device to launch apps, search for specific content and control playback… [+1987 chars]"
    },
    {
        "title": "Facebook expands 'community help' hub for people in quarantine",
        "description": "As Facebook sees \"unprecedented\" demand for its services, the company is now encouraging its users to help out their neighbors. The social network is expanding its \"community help\" feature to reach people affected by the coronavirus pandemic. With the update,…",
        "content": "With the update, Facebook users can post offers to help with things like transportation, groceries, baby supplies and volunteer work. Likewise, those seeking assistance can post about what they need, or filter existing offers to find one that matches what the… [+507 chars]"
    },
    {
        "title": "DoorDash is temporarily cutting small restaurant fees in half",
        "description": "DoorDash is reducing commissions for local restaurant partners by 50 percent in an effort to help businesses survive the COVID-19 crisis. The food delivery service says the program will benefit over 150,000 restaurants in the US, Canada and Australia on both …",
        "content": "DoorDash is reducing commissions for local restaurant partners by 50 percent in an effort to help businesses survive the COVID-19 crisis. The food delivery service says the program will benefit over 150,000 restaurants in the US, Canada and Australia on both … [+787 chars]"
    },
    {
        "title": "Razer's Blade 15 packs an 8-core Intel CPU and RTX 2080 Super",
        "description": "Razer has unveiled the 2020 Blade 15 Advanced with more gaming and content creation power, along with one long overdue addition. To start with, the Advanced model is the first Razer Blade with an 8-core CPU, namely the 10th-generation Intel Core i7-10875. Tha…",
        "content": "The Blade 15 Advanced also comes with NVIDIA's latest RTX 2070/2080 Super GPUs with Max-Q design. The new chips are not only faster than NVIDIA's last RTX flagships, the RTX 2080 and 2070, but feature NVIDIA's latest efficiency-boosting Max-Q tweaks like Adva… [+1515 chars]"
    },
    {
        "title": "Facebook's latest app experiment is a 'private space' for couples",
        "description": "If you have a special someone but don’t live with them, you’re probably feeling a bit stranded during the COVID-19 pandemic. However, Facebook might have a way to help you stay connected beyond the usual phone calls and video chats. Its experiment-oriented NP…",
        "content": "If you have a special someone but don’t live with them, you’re probably feeling a bit stranded during the COVID-19 pandemic. However, Facebook might have a way to help you stay connected beyond the usual phone calls and video chats. Its experiment-oriented NP… [+520 chars]"
    },
    {
        "title": "Spotify's standalone Kids app is now available in the US",
        "description": "When Spotify first launched its standalone app for kids last October, the possibilities were intriguing. It meant that parents could play music their kids like without having it impact their algorithmically generated playlists and recommendations on the servi…",
        "content": "Spotify is clear that the app is still very much in the beta phase. It continues to focus on updating the software while keeping things safe and relevant for the younger audience. However, the goal is still to offer a separate app that not only looks more inv… [+5882 chars]"
    },
    {
        "title": "The Morning After: Google's giving away two free months of Stadia Pro",
        "description": "While Zoom frantically tries to reassure users that its teleconferencing app can be safe and secure, Google is again reshuffling the deck chairs of its messaging strategy. The good news, for now, is that it has not launched a new service (yet), instead, as co…",
        "content": "Disney+ already has 50 million paying subscribers\r\nThat’s a lot of people waiting for ‘The Mandalorian’ season two.\r\nDisney’s streaming service has only been around for five months and despite a lack of hit original content, it’s already amassed an impressive… [+2715 chars]"
    },
    {
        "title": "An Imbalance Among Tiny Particles Offers a Big Cosmology Clue",
        "description": "If matter and antimatter cancel each other out, how can the universe exist? A discrepancy in the behavior of neutrinos and antineutrinos hints at an answer.",
        "content": "Physicists have detected the strongest evidence yet of a behavioral difference between elementary particles called neutrinos and their mirror-image twins, antineutrinos. The asymmetry could be the key to why so much more matter than antimatter arose during th… [+3511 chars]"
    },
    {
        "title": "The Pandemic Could Be an Opportunity to Remake Cities",
        "description": "Cities from Bogota to Oakland are closing streets to make room for pedestrians and bikers. Urbanists think we'd be healthier if such changes were permanent.",
        "content": "Last Tuesday, a Gemballa Mirage GT barrelled into a series of parked cars on a Manhattan street. The driver fled and was arrested. And for a moment, New York seemed almost normal, free of the quiet that has ruled the city for three weeks, since residents were… [+3606 chars]"
    },
    {
        "title": "The History of Pandemics Teaches Us Only That We Can't Be Taught",
        "description": "Is there a lesson in this repeating failure? Would we even learn it if there was?",
        "content": "On the last day of March, in what felt like the longest month in human history, U.S. President Donald Trump stood at the podium at the White House press briefing and mused on the lessons of this pandemic illness. When the threat of this new coronavirus fades,… [+5629 chars]"
    },
    {
        "title": "The Newest US Sanctions on China's Huawei Could Backfire",
        "description": "A reported ban on sales to Huawei of chips made with American equipment might intensify China's drive to develop its own chip industry.",
        "content": "Worsening relations between Washington and Beijing could trigger punishing new US restrictions on Huaweis supply of cutting-edge microchips. But some experts believe this would only backfire by pushing China, and other countries, to develop more alternatives … [+3606 chars]"
    },
    {
        "title": "To Cut Carbon, Ditch Air Travel—and Get on the Right Track",
        "description": "Some environmentally conscious people are trying to give up flying. For some trips, there's a great, cleaner alternative: It's called a train.",
        "content": "It started with the California forest fires. Ariella Granett lives in Berkeley, and stapling a paper smoke mask to fit her 8-year-old daughter's face made the planet's ills feel personal. Then, last spring, her son came home from school and announced the worl… [+5470 chars]"
    },
    {
        "title": "You Can Now Attend Ivy League Classes Online for Free",
        "description": "If you’ve always wanted to attend Harvard, now might be the perfect time: The university is offering access to 64 different courses online for free to anyone who signs up. Read more...",
        "content": "If youve always wanted to attend Harvard, now might be the perfect time: The university is offering access to 64 different courses online for free to anyone who signs up.\r\nCourses offerings include everything from web programming and music theory to meteorolo… [+1051 chars]"
    },
    {
        "title": "Where to Take Free Online Classes While You’re Stuck at Home",
        "description": "If you’ve always wanted to go back to school, why not put your ongoing involuntary stay-at-home downtime to good use with a free online class? There are literally thousands  of virtual university courses (known as Massive Open Online Courses, or MOOCs) and on…",
        "content": "If youve always wanted to go back to school, why not put your ongoing involuntary stay-at-home downtime to good use with a free online class? There are literally thousands of virtual university courses (known as Massive Open Online Courses, or MOOCs) and one-… [+3225 chars]"
    },
    {
        "title": "Can a VPN Hide What I Do on the Internet From My Employer?",
        "description": "When it comes to privacy issues, the best advice is the simplest advice: Don’t mix work and play. That means no installing BitTorrent on your work laptop; no browsing for naughty things when connected to your company wifi (or VPN) and no forwarding company se…",
        "content": "When it comes to privacy issues, the best advice is the simplest advice: Dont mix work and play. That means no installing BitTorrent on your work laptop; no browsing for naughty things when connected to your company wifi (or VPN) and no forwarding company sec… [+9651 chars]"
    },
    {
        "title": "Ask a Mental Health Expert About Navigating Life in a Pandemic",
        "description": "As we all navigate life in a pandemic, one of the pressing questions is how to prioritize our mental health in the midst of an unprecedented crisis. Given the rapid changes to our lives, the worries about a crashing economy, as well as the nonstop worries abo…",
        "content": "As we all navigate life in a pandemic, one of the pressing questions is how to prioritize our mental health in the midst of an unprecedented crisis. Given the rapid changes to our lives, the worries about a crashing economy, as well as the nonstop worries abo… [+1241 chars]"
    },
    {
        "title": "Now Is the Time to Embrace Your Guilty Pleasures",
        "description": "If you’ve spent your days in quarantine interacting with friends and family via Animal Crossing or bingeing every season of your favorite show, you’re not alone. Retreating to simple pleasures seems like a natural response to the stress we’re all living throu…",
        "content": "If youve spent your days in quarantine interacting with friends and family via Animal Crossing or bingeing every season of your favorite show, youre not alone. Retreating to simple pleasures seems like a natural response to the stress were all living througha… [+3938 chars]"
    },
    {
        "title": "Scientists Want to Know About Your Sourdough Starter",
        "description": "If you’ve ever tried making a sourdough starter, you know it’s a bit of an experiment. You’re literally capturing wild yeasts, feeding them, and hoping that they create a microbial community that will end up smelling and tasting delicious. Maybe you’ll be suc…",
        "content": "If youve ever tried making a sourdough starter, you know its a bit of an experiment. Youre literally capturing wild yeasts, feeding them, and hoping that they create a microbial community that will end up smelling and tasting delicious. Maybe youll be success… [+1039 chars]"
    },
    {
        "title": "How to Disinfect Your Bags",
        "description": "At this point, we’re all washing our hands for the allotted 20 seconds (right?) and cleaning the surfaces in our homes—but what about our bags? Although recreational travel may be at a halt, many of us are still traveling to work or the grocery store. The CDC…",
        "content": "At this point, were all washing our hands for the allotted 20 seconds (right?) and cleaning the surfaces in our homesbut what about our bags? Although recreational travel may be at a halt, many of us are still traveling to work or the grocery store. The CDC d… [+3470 chars]"
    },
    {
        "title": "What Does an 'Eviction Pause' Really Mean?",
        "description": "States and cities around the country have decided to pause evictions and utility shutoffs during the coronavirus pandemic. But if you’re at risk of being evicted, a moratorium may be only a temporary protection. Read more...",
        "content": "States and cities around the country have decided to pause evictions and utility shutoffs during the coronavirus pandemic. But if youre at risk of being evicted, a moratorium may be only a temporary protection.\r\nThere are some issues with the accommodations s… [+2211 chars]"
    },
    {
        "title": "Use a Squeeze Bottle as a DIY Bidet",
        "description": "I don’t know about you, but I am running out of toilet paper. I only have two rolls left in my cabinet, and my local grocery store has nothing but empty shelves. There wasn’t any toilet paper when I last visited the grocery store in person, two weeks ago—and …",
        "content": "I dont know about you, but I am running out of toilet paper. I only have two rolls left in my cabinet, and my local grocery store has nothing but empty shelves. There wasnt any toilet paper when I last visited the grocery store in person, two weeks agoand whe… [+2124 chars]"
    },
    {
        "title": "Why You Shouldn't Trust Your Phone's Blood Oxygen Sensor",
        "description": "There’s a belief that you can use your smartphone to accurately measure your SpO2—that’s your blood oxygen level. And while it would certainly be handy right now to have easy access to that figure—the same one you get when your doctor sticks your finger in th…",
        "content": "Theres a belief that you can use your smartphone to accurately measure your SpO2thats your blood oxygen level. And while it would certainly be handy right now to have easy access to that figurethe same one you get when your doctor sticks your finger in that l… [+4637 chars]"
    },
    {
        "title": "Why You Shouldn't Trust Your Phone's Blood Oxygen Sensor",
        "description": "There’s a belief that you can use your smartphone to accurately measure your SpO2—that’s your blood oxygen level. And while it would certainly be handy right now to have easy access to that figure—the same one you get when your doctor sticks your finger in th…",
        "content": "Theres a belief that you can use your smartphone to accurately measure your SpO2thats your blood oxygen level. And while it would certainly be handy right now to have easy access to that figurethe same one you get when your doctor sticks your finger in that l… [+4638 chars]"
    },
    {
        "title": "Toddler Tantrums: A Pandemic Survival Guide",
        "description": "Parenting young children is hard enough. Parenting young children during this pandemic is a whole new level of difficult. Between juggling work, child care and the worries brought on by a rapidly spreading disease and rapidly crashing economy, parents are str…",
        "content": "Parenting young children is hard enough. Parenting young children during this pandemic is a whole new level of difficult. Between juggling work, child care and the worries brought on by a rapidly spreading disease and rapidly crashing economy, parents are str… [+3378 chars]"
    },
    {
        "title": "Toddler Tantrums: A Pandemic Survival Guide",
        "description": "Parenting young children is hard enough. Parenting young children during this pandemic is a whole new level of difficult. Between juggling work, child care and the worries brought on by a rapidly spreading disease and rapidly crashing economy, parents are str…",
        "content": "Parenting young children is hard enough. Parenting young children during this pandemic is a whole new level of difficult. Between juggling work, child care and the worries brought on by a rapidly spreading disease and rapidly crashing economy, parents are str… [+3378 chars]"
    },
    {
        "title": "What Is 'Decision Fatigue' and How Does It Affect You?",
        "description": "Just a few months ago, we would have gone out for brunch with our friends, made a quick stop at the store to pick up a gallon of milk, and visited our grandparents, all without a second thought. Read more...",
        "content": "Just a few months ago, we would have gone out for brunch with our friends, made a quick stop at the store to pick up a gallon of milk, and visited our grandparents, all without a second thought. \r\nThen came the coronavirus. Then came the reports about communi… [+3430 chars]"
    },
    {
        "title": "It's OK to Grieve the Small Things",
        "description": "Read more...",
        "content": "These past few months, as we have all navigated a rapidly changing situation, there have been a lot of treasured things, small and large, we have had to give up. Whether its canceling events such as birthday parties, proms, weddings, once-in-a-lifetime trips,… [+3172 chars]"
    },
    {
        "title": "Will Only Children Have a Tougher Time During the Pandemic?",
        "description": "If you’re a parent of any number of children, chances are good you’re worried about the effect this time in isolation is having on them. Parents of kids with special needs are struggling to get the services their children usually rely on. Parents of multiple …",
        "content": "If youre a parent of any number of children, chances are good youre worried about the effect this time in isolation is having on them. Parents of kids with special needs are struggling to get the services their children usually rely on. Parents of multiple ki… [+5314 chars]"
    },
    {
        "title": "Herd Immunity Won't Save Us",
        "description": "If we cannot stop COVID-19, can we at least look forward to the point in time when we are all survivors of the disease, and presumably immune? It’s a tempting idea, but fatally flawed. Herd immunity can protect individuals, but it won’t keep a population safe…",
        "content": "If we cannot stop COVID-19, can we at least look forward to the point in time when we are all survivors of the disease, and presumably immune? Its a tempting idea, but fatally flawed. Herd immunity can protect individuals, but it wont keep a population safe f… [+5901 chars]"
    },
    {
        "title": "How to Help Your High School Senior Cope With Having Their Year Cut Short",
        "description": "Think back to your senior year of high school. Once spring rolled around, you were basically home-free and could finally experience the joy of “senioritis”: getting to go to school and see your friends while enjoying lower academic expectations. Plus there we…",
        "content": "Think back to your senior year of high school. Once spring rolled around, you were basically home-free and could finally experience the joy of senioritis: getting to go to school and see your friends while enjoying lower academic expectations. Plus there were… [+7364 chars]"
    },
    {
        "title": "What Parents Should Know about Teens and Social Media Fame",
        "description": "Rhiannon Ragland has never been particularly interested in building her own social media presence. But as the mom of a teenager, she adheres to parental best practices—she follows her daughter Brenna’s accounts, pays attention to what she posts, and has talke…",
        "content": "Rhiannon Ragland has never been particularly interested in building her own social media presence. But as the mom of a teenager, she adheres to parental best practicesshe follows her daughter Brennas accounts, pays attention to what she posts, and has talked … [+6040 chars]"
    },
    {
        "title": "Now Is Not the Time to Text Your Ex",
        "description": "These long days and nights of quarantine have made us start doing things we probably wouldn’t, under normal circumstances. Whether you’ve devoted hours to baking the perfect sourdough or putting together 1,000-piece puzzles, you may have a whole new set of ho…",
        "content": "These long days and nights of quarantine have made us start doing things we probably wouldnt, under normal circumstances. Whether youve devoted hours to baking the perfect sourdough or putting together 1,000-piece puzzles, you may have a whole new set of hobb… [+6199 chars]"
    },
    {
        "title": "Creative Destruction Lab launches a new startup program dedicated to COVID-19 response",
        "description": "Global academic science and tech startup accelerator program Creative Destruction Lab (CDL) is adding a dedicated stream to its existing areas of focus, which include AI, health sciences, space, quantum computing, blockchain, energy, and oceans. The new addit…",
        "content": "Global academic science and tech startup accelerator program Creative Destruction Lab (CDL) is adding a dedicated stream to its existing areas of focus, which include AI, health sciences, space, quantum computing, blockchain, energy, and oceans. The new addit… [+2394 chars]"
    },
    {
        "title": "How COVID-19 is revitalizing Cuba's medical diplomacy, even Trump's 'maximum pressure' aims to shut it down",
        "description": "REUTERS/Alexandre Meneghini Cuba's longstanding efforts to promote its healthcare system has seen a boost as its medical professionals deploy abroad to aid the fight against the coronavirus. The US and right-wing governments in the region have tried to put mo…",
        "content": "None"
    },
    {
        "title": "Richard leBrasseur - MENAFN.COM",
        "description": "(MENAFN - The Conversation) Dr. Rick leBrasseur is an Associate Professor of Landscape Architecture at Dalhousie University within the Department of Plant, Food and Environmental Sciences.\nA licensed landscape architect, environmental psychologist, researcher…",
        "content": "(MENAFN - The Conversation) Dr. Rick leBrasseur is an Associate Professor of Landscape Architecture at Dalhousie University within the Department of Plant, Food and Environmental Sciences.\r\nA licensed landscape architect, environmental psychologist, researche… [+3095 chars]"
    },
    {
        "title": "71 more COVID-19 cases, 3 new deaths confirmed in a 24-hour period in B.C. - CTV News",
        "description": "<ol><li>71 more COVID-19 cases, 3 new deaths confirmed in a 24-hour period in B.C.  CTV News\r\n</li><li>Coronavirus: Interior Health region confirmed cases remain at 153  Global News\r\n</li><li>COVID-19 outbreak at B.C. chicken processing plant: 28 employees te…",
        "content": "VANCOUVER -- \r\nHealth officials have announced another three deaths from COVID-19 in British Columbia, plus 71 more test-positive cases.\r\nWednesday's announcement from provincial health officer Dr. Bonnie Henry represents B.C.'s biggest jump in new cases in a… [+2679 chars]"
    },
    {
        "title": "Nova Scotia extends coronavirus state of emergency, announces new support funds - Global News",
        "description": "Nova Scotia extends coronavirus state of emergency, announces new support funds Global News 'This does make me nervous': N.S. reports biggest one-day spike of COVID-19 cases CTV News Atlantic Canadians call for rent freeze during COVID-19 pandemic Global News…",
        "content": "Nova Scotia has announced a pair of funds that are meant to help workers and small businesses in the province.\r\nPremier Stephen McNeil announced the two $20-million funds during a provincial update on Thursday.\r\nThe first is known as the Worker Emergency Brid… [+3597 chars]"
    },
    {
        "title": "Worker from JBS meat packing plant near Brooks dies with COVID-19 test pending - Global News",
        "description": "<ol><li>Worker from JBS meat packing plant near Brooks dies with COVID-19 test pending  Global News\r\n</li><li>Meat plant closures over COVID-19 may affect supply  CBC News\r\n</li><li>'We do see it as a critical situation': How COVID-19 is impacting Canada's me…",
        "content": "Provincial health officials confirmed Wednesday that a worker from the JBS meat packing plant near Brooks, Alta., has died while awaiting results from a COVID-19 test. \r\n“There are two additional deaths in Brooks in people with COVID (tests) pending, one of t… [+3774 chars]"
    },
    {
        "title": "What will Canada's Pandexit strategy look like? How officials are deciding when to lift coronavirus lockdowns - The Globe and Mail",
        "description": "When the country begins to reopen, it will be a gradual, tentative and potentially frustrating process, experts say. Here’s a primer on who will make the decisions and what has to be considered",
        "content": "Illustration by The Globe and Mail\r\nThe discussion about how to begin reopening Canadian society is ramping up, even as the country has yet to pass the peak of the pandemic that has shut it down.\r\nIn provinces with relatively low COVID-19 rates, governments h… [+30156 chars]"
    },
    {
        "title": "Programmieren in Zeiten der Pandemie – Studie untersucht die Folgen",
        "description": "Die Veranstalter der Studie suchen Softwareentwickler, die sich an einer Umfrage zu den Auswirkungen des zwangsweisen Umzugs ins Home-Office beteiligen.",
        "content": "Unter dem Titel \"Pandemic Programming\" läuft derzeit eine Studie zu den Auswirkungen der verpflichtenden Heimarbeit auf den Bereich der Softwareentwicklung. Die Organisatoren bitten Entwickler, sich dafür an einer Online-Umfrage zu beteiligen, die etwa zwanzi… [+1744 chars]"
    },
    {
        "title": "On the front lines of the coronavirus-vaccine battle",
        "description": "Canadian virologist Alyson Kelvin raced across the country to begin a collaboration to develop vaccines against COVID-19.",
        "content": "Alyson Kelvin in her containment lab.Credit: Danny Abriel\r\nInfectious-disease researcher Alyson Kelvin jumped into action when she first learnt of an emerging pathogen in China. In February, she temporarily left her laboratory at Dalhousie University in Nova … [+4693 chars]"
    },
    {
        "title": "On the front lines of the coronavirus-vaccine battle",
        "description": "Canadian virologist Alyson Kelvin raced across the country to begin a collaboration to develop vaccines against COVID-19.",
        "content": "Alyson Kelvin in her containment lab.Credit: Danny Abriel\r\nInfectious-disease researcher Alyson Kelvin jumped into action when she first learnt of an emerging pathogen in China. In February, she temporarily left her laboratory at Dalhousie University in Nova … [+4693 chars]"
    },
    {
        "title": "Landmark study concludes marine life can be rebuilt by 2050",
        "description": "An international study recently published in the journal Nature, led by KAUST Professors Carlos Duarte and Susana Agustí, lays out the essential roadmap of actions required for the planet's marine life to recover to full abundance by 2050.",
        "content": "An international study recently published in the journal Nature, led by KAUST Professors Carlos Duarte and Susana Agustí, lays out the essential roadmap of actions required for the planet's marine life to recover to full abundance by 2050.\r\nThe project brings… [+4918 chars]"
    },
    {
        "title": "Creative Destruction Lab launches a new startup program dedicated to COVID-19 response",
        "description": "Global academic science and tech startup accelerator program Creative Destruction Lab (CDL) is adding a dedicated stream to its existing areas of focus, which include AI, health sciences, space, quantum computing, blockchain, energy, and oceans. The new addit…",
        "content": "Global academic science and tech startup accelerator program Creative Destruction Lab (CDL) is adding a dedicated stream to its existing areas of focus, which include AI, health sciences, space, quantum computing, blockchain, energy, and oceans. The new addit… [+2394 chars]"
    },
    {
        "title": "Listen: Ellen Page on Directing Netflix Doc, Justin Trudeau and Donald Trump’s Environmental Records",
        "description": "Ellen Page is now calling the shots from behind the camera. The “X-Men” star makes her directorial debut with “There’s Something in the Water,” the new Netflix documentary she co-directed with Ian Daniel about the impact of environmental racism on marginalize…",
        "content": "Ellen Page is now calling the shots from behind the camera.\r\nThe “X-Men” star makes her directorial debut with “There’s Something in the Water,” the new Netflix documentary she co-directed with Ian Daniel about the impact of environmental racism on marginaliz… [+2634 chars]"
    },
    {
        "title": "Food Rationing New Reality for Buyers Once Spoiled for Choice...",
        "description": "(Bloomberg) -- At a Publix store in St. Petersburg, Florida, handmade signs limit customers to two packages of beef, pork and Italian sausage. In Toronto, shoppers at a west end Loblaws can’t buy more than two dozen eggs and two gallons of milk.Spoiled for ch…",
        "content": "(Bloomberg) -- At a Publix store in St. Petersburg, Florida, handmade signs limit customers to two packages of beef, pork and Italian sausage. In Toronto, shoppers at a west end Loblaws cant buy more than two dozen eggs and two gallons of milk.\r\nSpoiled for c… [+3834 chars]"
    },
    {
        "title": "4 foods that are likely to suffer from climate change",
        "description": "From where they're grown to how they taste to when we eat them, very little will stay the same in coming decades.",
        "content": "From where they're grown to how they taste to when we eat them, very little will stay the same in coming decades.\r\nClimate change threatens many of the world's favorite foods. A writeup in National Geographic's Earth Day 2020 magazine by Daniel Stone lists se… [+5550 chars]"
    },
    {
        "title": "Wheat in Whitehorse: how climate change helps feed Canada's remote regions",
        "description": "After failing to grow wheat in Canada's subarctic Yukon territory 15 years ago, farmer Steve Mackenzie-Grieve gave it another shot in 2017.",
        "content": "WINNIPEG, Manitoba/OTTAWA (Reuters) - After failing to grow wheat in Canada’s subarctic Yukon territory 15 years ago, farmer Steve Mackenzie-Grieve gave it another shot in 2017. \r\nThanks to longer summers, he has reaped three straight harvests. This spring he… [+4741 chars]"
    },
    {
        "title": "Pandemic 'poses particular challenges' for food processing plants: Freeland",
        "description": "Deputy Prime Minister Chrystia Freeland says the government is working on ways to support Canada’s food processing plants during the COVID-19 pandemic amid concerns about labour shortages.",
        "content": "Deputy Prime Minister Chrystia Freeland says the government is working on ways to support Canada's food processing plants during the COVID-19 pandemic in response to concerns about labour shortages.\r\n\"I am so grateful to all of our farmers and ranchers and fo… [+7688 chars]"
    },
    {
        "title": "Age is not the only risk for severe coronavirus disease - WJW FOX 8 News Cleveland",
        "description": "Age is not the only risk for severe coronavirus disease WJW FOX 8 News Cleveland Anosmia: The 'hidden' coronavirus symptom many young patients are developing Daily Star Smell test: Possible new COVID-19 symptom emerges SCNow Loss of smell may be symptom of ne…",
        "content": "WASHINGTON (AP) Older people remain most at risk of dying as the new coronavirus continues its rampage around the globe, but theyre far from the only ones vulnerable. One of many mysteries: Men seem to be faring worse than women.\r\nAnd as cases skyrocket in th… [+6013 chars]"
    },
    {
        "title": "Provincial border checkpoints barring entry, restricting travel raise constitutional questions",
        "description": "While the coronavirus pandemic has prompted a shutdown of non-essential travel at the Canada-U.S. border, many provinces have also set up checkpoints at their borders to restrict traffic, raising questions about the constitutionality of such measures.",
        "content": "While the coronavirus pandemic has prompted a shutdown of non-essential travel at the Canada-U.S. border, a number of provinces have also set up checkpoints at their borders to restrict traffic, raising questions about the constitutionality of such measures.\r… [+7751 chars]"
    },
    {
        "title": "More than 95% Canada’s beef comes from 3 processing plants. Two of them have COVID-19 outbreaks",
        "description": "Experts say the pandemic is exposing the risk of having a few producers make most of Canada’s beef.",
        "content": "OTTAWA—The coronavirus pandemic is exposing the risk of relying on a few industrial slaughterhouses for a huge portion of Canada’s beefsupply, according to food experts and a national farmers’ union. \r\nMore than 95 per cent of Canada’s beef production comes f… [+3607 chars]"
    },
    {
        "title": "Canada shooting: Police defend lack of emergency alert",
        "description": "At least 22 people were shot in the province of Nova Scotia before police shot the gunman dead.",
        "content": "Image copyrightReutersImage caption\r\n Memorials, including virtual ones, commemorate the victims\r\nPolice say they were preparing an emergency alert when police shot and killed the suspect in the worst mass shooting in Canada's modern history.\r\nAuthorities hav… [+4325 chars]"
    },
    {
        "title": "Canada police arrest suspected gunman, say there have been several victims",
        "description": "Police in the Atlantic Canadian province of Nova Scotia on Sunday arrested a 51-year-old gunman who they said was suspected of shootings that had resulted in several victims.",
        "content": "OTTAWA (Reuters) - Police in the Atlantic Canadian province of Nova Scotia on Sunday arrested a 51-year-old gunman who they said was suspected of shootings that had resulted in several victims. \r\nThe Royal Canadian Mounted Police said the shootings occurred i… [+897 chars]"
    },
    {
        "title": "Policewoman, teacher and nurse among victims of Canada mass shooting",
        "description": "Families across Canada struggled on Monday to come to grips with the deadliest shooting rampage in the country's history, in which the victims included a veteran police officer, a teacher and a nurse.",
        "content": "(Reuters) - Families across Canada struggled on Monday to come to grips with the deadliest shooting rampage in the country’s history, in which the victims included a veteran police officer, a teacher and a nurse. \r\nConstable Heidi Stevenson had spent about 23… [+2830 chars]"
    },
    {
        "title": "Koodoo launched a tool to help consumers navigate mortgage payment holidays",
        "description": "This story was delivered to Business Insider Intelligence Fintech Briefing subscribers earlier this morning. To get this story plus others to your inbox each day, hours before they're published on Business Insider, click here. The UK-based mortgage technology…",
        "content": "The UK-based mortgage technology provider, which offers its solutions to lenders and aggregators, has introduced a new website and technology toolkit that aims to offer consumers guidance on mortgage payment holidays amid the coronavirus outbreak, according t… [+2946 chars]"
    },
    {
        "title": "NSLC makes new adjustments to store hours amid COVID-19 pandemic - CTV News",
        "description": "NSLC makes new adjustments to store hours amid COVID-19 pandemic CTV News NSHA warning of potential COVID-19 exposure at Halifax restaurant Global News N.S. identifies 17 new COVID-19 cases, bringing the total to 445 CTV News Nova Scotia reports 17 new cases …",
        "content": "HALIFAX -- \r\nNova Scotia Liquor Corporation has adjusted its hours in the wake of COVID-19.\r\nOn Sunday, the retailer posted an update to its website notifying customers that all stores will be open Monday to Saturday from 10:00 a.m. until 6:00 p.m. with 10:00… [+138 chars]"
    },
    {
        "title": "Nova Scotia identifies 21 new cases of COVID-19 - CTV News",
        "description": "Nova Scotia identifies 21 new cases of COVID-19 CTV News Halifax Regional Police officer tests positive for COVID-19 as N.S. cases rise to 428 CBC.ca NSHA warning of potential COVID-19 exposure on Halifax bus routes Global News Nova Scotia identifies 34 new c…",
        "content": "HALIFAX -- \r\nOn Saturday, Nova Scotia announced it has identified 21 new confirmed cases of COVID-19, bringing the provincial total to 428.\r\nThe QEII Health Sciences Centres microbiology lab completed 885 Nova Scotia tests on Friday.\r\nNinety-five individuals … [+2358 chars]"
    },
    {
        "title": "‘Never felt this way in my life,’ says Halifax woman who recovered from COVID-19 - Global News",
        "description": "‘Never felt this way in my life,’ says Halifax woman who recovered from COVID-19 Global News 'This does make me nervous': N.S. reports biggest one-day spike of COVID-19 cases CTV News ‘Irresponsible and blatantly false’: N.S. premier calls out April Fool’s Da…",
        "content": "Emily Dwyer says fighting COVID-19 was unlike anything shes ever experienced.\r\nThe 26-year-old from Halifax was one of the first in the province to test positive for the virus, which she contracted on an international trip. Now, she’s one of 11 in Nova Scotia… [+4143 chars]"
    },
    {
        "title": "Being on the East Coast a double-edged sword in COVID-19 pandemic medical battle - ThoroldNews.com",
        "description": "HALIFAX — Being a small East Coast province in the pandemic is a double-edged sword: there are fewer critically ill patients, but the supply of hospital beds is limited if the worst-case scenario materializes.",
        "content": "HALIFAX Being a small East Coast province in the pandemic is a double-edged sword: there are fewer critically ill patients, but the supply of hospital beds is limited if the worst-case scenario materializes.\r\n\"We will have fewer beds, but we will have a lower… [+4933 chars]"
    },
    {
        "title": "Four people in N.S. charged for failing to self-isolate, maintain a social distance - CTV News",
        "description": "Four people in N.S. charged for failing to self-isolate, maintain a social distance CTV News ‘Never felt this way in my life,’ says Halifax woman who recovered from COVID-19 Global News 'This does make me nervous': N.S. reports biggest one-day spike of COVID-…",
        "content": "HALIFAX -- \r\nNova Scotia RCMP have charged four people under the Health Protection Act in connection with the current COVID-19 pandemic.\r\nIn a news release, police say two people were charged for failing to self-isolate after returning from out of the country… [+1549 chars]"
    },
    {
        "title": "Nova Scotia reports 3 deaths at Northwood Manor in Halifax due to COVID-19 - Global News",
        "description": "<ol><li>Nova Scotia reports 3 deaths at Northwood Manor in Halifax due to COVID-19  Global News\r\n</li><li>3 people from 1 long-term care home die from COVID-19 in Nova Scotia  CBC.ca\r\n</li><li>Total of 51 residents, 33 staff infected by COVID-19 at Halifax's …",
        "content": "Nova Scotia has recorded three more deaths as a result of COVID-19.\r\nThat now means seven people have died in the province as a result of the disease.\r\nAll three deaths occurred at Northwood Manor in Halifax on Friday.\r\nREAD MORE: Total of 84 residents, staff… [+2596 chars]"
    },
    {
        "title": "NSHA warning of potential COVID-19 exposure at Halifax restaurant - Global News",
        "description": "NSHA warning of potential COVID-19 exposure at Halifax restaurant Global News N.S. reports third COVID-19 death, 29 new cases CTV News Coronavirus outbreak: Nova Scotia announces third COVID-19 death, total cases increase to 474 | FULL Global News 'They don't…",
        "content": "NSHA Public Health is warning of potential exposure to COVID-19 at G-Street Pizza, 2302 Gottingen Street, on April 4 and April 6.\r\nPublic Health said it’s directly contacting anyone known to be a close contact of the individual or people confirmed to have COV… [+954 chars]"
    },
    {
        "title": "Nova Scotia's COVID-19 cases rise to 293 in biggest single-day jump - TheChronicleHerald.ca",
        "description": "Nova Scotia's COVID-19 cases rise to 293 in biggest single-day jump TheChronicleHerald.ca 31 new cases of COVID-19 found in Nova Scotia, testing moves to 24/7 CBC.ca Nova Scotia reports 31 new COVID-19 cases; biggest one-day spike CTV News War is the wrong me…",
        "content": "The number of COVID-19 cases has risen to 293 in Nova Scotia, the Health Department reported Monday. \r\nIn the biggest single-day jump in the province, 31 more cases were identified. \r\nTo date, Nova Scotia has tested 10,511 people for the respiratory virus, wh… [+2151 chars]"
    },
    {
        "title": "13 of 43 new COVID-19 cases announced Tuesday in Halifax's Northwood facility - HalifaxToday.ca",
        "description": "13 of 43 new COVID-19 cases announced Tuesday in Halifax's Northwood facility HalifaxToday.ca Number of COVID-19 cases surpasses 500 as N.S. reports 43 new cases CTV News N.S. construction workers staying home amid fears of health, safety during pandemic TheC…",
        "content": "HALIFAX — Nova Scotia recorded one of its largest single daily jumps in confirmed COVID-19 cases Tuesday, a development partly attributed to outbreaks in at least two long-term care homes in the Halifax area.\r\nThe province reported 43 new cases, pushing the t… [+5072 chars]"
    },
    {
        "title": "Three shoppers ticketed for failing to self-isolate after entering N.S. - Global News",
        "description": "Three shoppers ticketed for failing to self-isolate after entering N.S. Global News Nova Scotia reports 31 new COVID-19 cases; biggest one-day spike CTV News Halifax and Associates is not registered to sell securities in our province says alert HalifaxToday.c…",
        "content": "Three people in Amherst have been fined for disobeying orders under the Health Protection Act.\r\nThe Amherst Police Department says its officers issued the summary offence tickets Monday after they learned three people who had recently crossed the border into … [+667 chars]"
    },
    {
        "title": "N.S. reports third COVID-19 death, 29 new cases - CTV News",
        "description": "N.S. reports third COVID-19 death, 29 new cases CTV News Coronavirus: Third death recorded in Nova Scotia as case total hits 474 Global News Nova Scotia identifies 17 new cases of COVID-19 CTV News 'They don't continue to climb': N.S. encouraged by daily rate…",
        "content": "HALIFAX -- \r\nAn elderly man from the Halifax area is Nova Scotias third death resulting from COVID-19.\r\nThe province said Monday that the man was in his 80s and had underlying health issues.\r\nHe died in the Halifax Regional Municipality on Monday.  \r\nHealth o… [+4372 chars]"
    },
    {
        "title": "4th death connected to COVID-19 reported in Nova Scotia, state of emergency extended - Global News",
        "description": "4th death connected to COVID-19 reported in Nova Scotia, state of emergency extended Global News Fourth person dies from COVID-19 in Nova Scotia as cases rise to 606 CBC.ca Nova Scotia reports fourth COVID-19 death, 27 new cases; 606 total CTV News 22 more ti…",
        "content": "Nova Scotia announced it would be extending its state of emergency the same day it reported the province’s fourth death connected to the novel coronavirus.\r\nThe province said Friday that a woman in her 80s in Cape Breton died as a result of complications rela… [+6064 chars]"
    },
    {
        "title": "Four people, business charged for violating COVID-19 rules in Nova Scotia - CTV News",
        "description": "Four people, business charged for violating COVID-19 rules in Nova Scotia CTV News Google Mobility Reports a slippery slope: cyber security expert Global News 'Stay the blazes home,' premier warns as COVID-19 cases rise in Nova Scotia CBC.ca 'The virus will f…",
        "content": "HALIFAX -- \r\nFour people and a business in Nova Scotia have been charged after for violating the provinces Health Protection and Emergency Management acts in relation to COVID-19.\r\nThe RCMP says, on Wednesday, three people were charged for failing to comply w… [+509 chars]"
    },
    {
        "title": "Nova Scotia reports three more COVID-19 deaths, 43 new cases - CTV News",
        "description": "<ol><li>Nova Scotia reports three more COVID-19 deaths, 43 new cases  CTV News\r\n</li><li>3 people from 1 long-term care home die from COVID-19 in Nova Scotia  CBC.ca\r\n</li><li>Nova Scotia reports 3 deaths at Northwood Manor in Halifax due to COVID-19  Global …",
        "content": "HALIFAX -- \r\nNova Scotia is reporting three more COVID-19-related deaths, bringing the province's total deaths to seven.\r\nThe three deaths all occurred at Halifax's Northwood long-term care home on Friday. There is no more information at this time regarding t… [+4745 chars]"
    },
    {
        "title": "Would-be victim reveals Nova Scotia gunman had ‘list of people to target’: report - CityNews Vancouver",
        "description": "<ol><li>Would-be victim reveals Nova Scotia gunman had ‘list of people to target’: report  CityNews Vancouver\r\n</li><li>'They don't know if they've caught him': Recordings reveal chaos of Nova Scotia manhunt  CBC.ca\r\n</li><li>Chris Selley: Trudeau was wrong t…",
        "content": "HALIFAX (NEWS 1130) – Disturbing details are emerging as the investigation into last weekend’s murder spree in Nova Scotia continues.\r\nThe gunman — responsible for 22 deaths at 16 different crime-scenes — apparently had a so-called hit-list, according to a re… [+2654 chars]"
    },
    {
        "title": "N.S. announces new COVID-19 assessment centres, 26 new cases - CTV News",
        "description": "N.S. announces new COVID-19 assessment centres, 26 new cases CTV News Nova Scotia to increase testing in communities with COVID-19 'clusters' CBC.ca Premier’s ‘delightfully Nova Scotian’ cry to respect physical distancing goes viral Global News N.S. identifie…",
        "content": "HALIFAX -- \r\nNova Scotia has identified 26 new cases of COVID-19, bringing the province's total to 262.\r\nThe 262 cases range in age from under 10 to over 90. The province is reporting 53 people have recovered, and six people are currently hospitalized.\r\nThe p… [+3103 chars]"
    },
    {
        "title": "What to Stream Tonight, March 26, 2020",
        "description": "Ready to settle in for another night at home? Read more...",
        "content": "Ready to settle in for another night at home?\r\nYesterday we told you about some live concerts to watch, fitness and cooking classes, and how you can watch Star Trek: Picard for free through April 23rd.\r\nToday we found an online culinary school offering 30 day… [+2158 chars]"
    },
    {
        "title": "Instacart is hiring another 250,000 grocery shoppers",
        "description": "Despite worker protests and claims that COVID-19 safety gear isn’t available yet, Instacart is still seeing a surge in customer demand. With order volume up 500 percent year-over-year and the average customer basket size increasing by 35 percent, Instacart an…",
        "content": "Instacart promises it’s doing more to support its workforce. To log into the app, workers will have to take a daily wellness check. If they confirm symptoms of COVID-19, including fever, cough or difficulty breathing, they’ll be logged off for the day and tol… [+1721 chars]"
    },
    {
        "title": "So Wait, How Encrypted Are Zoom Meetings Really?",
        "description": "The service's mixed messages have frustrated cryptographers, as the US government and other sensitive organizations increasingly depend on it.",
        "content": "An analysis of Zoom's encryption scheme, published on Friday by Citizen Lab at the University of Toronto, shows that Zoom does generate and hold all keys itself on key management systems. The report notes that most of Zoom's developers are based in China, and… [+3993 chars]"
    },
    {
        "title": "Clever Cryptography Could Save Privacy in Covid-19 Contact-Tracing Apps",
        "description": "Researchers are racing to achieve the benefits of location-tracking without the surveillance.",
        "content": "Before the Covid-19 pandemic, any system that used smartphones to track locations and contacts sounded like a dystopian surveillance nightmare. Now, it sounds like a dystopian surveillance nightmare that could also save millions of lives and rescue the global… [+6421 chars]"
    },
    {
        "title": "Clearbanc cuts staff to navigate ‘long-term economic impacts’ of COVID-19",
        "description": "Clearbanc, a Toronto-based company that funds startups through equity-free investments, has laid off 17 employees to help it navigate the long-term economic impact of COVID-19, TechCrunch has learned. The cuts impact about 8% of the staff, with affecting role…",
        "content": "Clearbanc, a Toronto-based company that funds startups through equity-free investments, has laid off 17 employees to help it navigate the long-term economic impact of COVID-19, TechCrunch has learned.\r\nThe cuts impact about 8% of the staff, with affecting rol… [+2383 chars]"
    },
    {
        "title": "Startup group works to get flat-packed protective boxes to frontline COVID-19 medical workers",
        "description": "There are a number of initiatives by startup companies and entrepreneurs looking to support the healthcare response to COVID-19, and one that’s addressing a need in the realm of personal protective equipment is the COVID Box project launched by a group of vol…",
        "content": "There are a number of initiatives by startup companies and entrepreneurs looking to support the healthcare response to COVID-19, and one that’s addressing a need in the realm of personal protective equipment is the COVID Box project launched by a group of vol… [+2405 chars]"
    },
    {
        "title": "Creative Destruction Lab launches a new startup program dedicated to COVID-19 response",
        "description": "Global academic science and tech startup accelerator program Creative Destruction Lab (CDL) is adding a dedicated stream to its existing areas of focus, which include AI, health sciences, space, quantum computing, blockchain, energy, and oceans. The new addit…",
        "content": "Global academic science and tech startup accelerator program Creative Destruction Lab (CDL) is adding a dedicated stream to its existing areas of focus, which include AI, health sciences, space, quantum computing, blockchain, energy, and oceans. The new addit… [+2394 chars]"
    },
    {
        "title": "Zoom's New Update Sure Seems Like an Attempt to Not Be Labeled a National Security Threat",
        "description": "At the start of this month, Zoom announced that it would be halting any new feature rollouts for the next 90 days to address the myriad security and privacy concerns currently facing the multi-billion dollar company. Evidently though, that feature freeze has …",
        "content": "At the start of this month, Zoom announced that it would be halting any new feature rollouts for the next 90 days to address the myriad security and privacy concerns currently facing the multi-billion dollar company. Evidently though, that feature freeze has … [+2479 chars]"
    },
    {
        "title": "A Woman's Breast Implants Saved Her Life From a Gunshot, Doctors Say",
        "description": "Doctors say a woman’s silicone breast implants deflected what could have been a fatal bullet, stopping it from reaching her heart. Amazingly, this is not the first time such a thing has been reported in medical literature.Read more...",
        "content": "Doctors say a womans silicone breast implants deflected what could have been a fatal bullet, stopping it from reaching her heart. Amazingly, this is not the first time such a thing has been reported in the medical literature.\r\nThe miraculous bullet deflection… [+2616 chars]"
    },
    {
        "title": "CDC Strips Page on Hydroxychloroquine of 'Unusual' Guidance for Doctors",
        "description": "The Centers for Disease Control and Prevention (CDC) has changed text on their website to remove guidance for physicians on the possible usage of hydroxychloroquine and chloroquine, two drugs touted as a wonder cure for covid-19 by Donald Trump, on patients. …",
        "content": "The Centers for Disease Control and Prevention (CDC) has changed text on their website to remove guidance for physicians on the possible usage of hydroxychloroquine and chloroquine, two drugs touted as a wonder cure for covid-19 by Donald Trump, on patients.\r… [+5395 chars]"
    },
    {
        "title": "Coronavirus Has Slashed Global Air Pollution. This Interactive Map Shows How.",
        "description": "The covid-19 pandemic has changed the world, grinding to a halt increasingly large geographic areas and portions of the economy in an effort to slow the virus’ spread. Read more...",
        "content": "The covid-19 pandemic has changed the world, grinding to a halt increasingly large geographic areas and portions of the economy in an effort to slow the virus spread.\r\nThe impacts have been profound on the ground, but government-mandated lockdowns have also r… [+6988 chars]"
    },
    {
        "title": "What it's like to live with someone who still doesn't take coronavirus seriously",
        "description": "Over the past few weeks, Carlos Martinez has been eyeing the news for coronavirus coverage. All the while, his partner shrugs off his concerns. \"[She] would dismiss it every time she saw me watching the news,\" Martinez told me. \"She would make comments like '…",
        "content": "Over the past few weeks, Carlos Martinez has been eyeing the news for coronavirus coverage.\r\nAll the while, his partner shrugs off his concerns.\r\n\"[She] would dismiss it every time she saw me watching the news,\" Martinez told me. \"She would make comments like… [+7043 chars]"
    },
    {
        "title": "Super League clubs discussing no relegation - Toronto chief",
        "description": "Some Super League clubs think there should be no relegation in 2020 because of coronavirus disruption, says Toronto chairman Bob Hunter.",
        "content": "Toronto's Sonny Bill Williams has the most offloads in Super League this season with 23\r\nSome Super League clubs think there should be no relegation in 2020 because of disruption caused by coronavirus, says Toronto chairman Bob Hunter.\r\nThe Canadian side were… [+1265 chars]"
    },
    {
        "title": "Rogers Cup: WTA Tour event postponed until August 2021",
        "description": "The women's section of the Rogers Cup is postponed for a year because of the coronavirus pandemic.",
        "content": "Serena Williams is a three-time Rogers Cup champion but was forced to withdraw from the final in 2019 due to injury\r\nThe women's section of the Rogers Cup has been postponed for a year because of the coronavirus pandemic.\r\nThe decision to call off August's WT… [+804 chars]"
    },
    {
        "title": "Big splash: The world's largest designer of water parks",
        "description": "Geoff Chutter is the founder of Whitewater West, the world's largest water park design firm.",
        "content": "Media captionGeoff Chutter says that when hiring staff he looks for positivity rather than skills.\r\nIn 1980 Geoff Chutter found himself \"mortgaged to the underside of the nostrils\", and the owner of a brand new water park.\r\nThe then 28-year-old had no previou… [+6344 chars]"
    },
    {
        "title": "A sports junkie adjusts to life without any sport",
        "description": "Unless you're Jared Leto living in isolation in the desert, you've probably been impacted by the spread of coronavirus (only teasing, Jared! You're good!)",
        "content": "(CNN)Unless you're Jared Leto living in isolation in the desert, you've probably been impacted by the spread of coronavirus (only teasing, Jared! You're good!)\r\nI'm writing this from my living room after CNN urged its employees to work from home.\r\nSo far, so … [+7286 chars]"
    },
    {
        "title": "Your pictures on the theme of 'insects'",
        "description": "Each week, we publish a gallery of readers' pictures on a set theme. This week it is \"insects\".",
        "content": "<li>Paul Granahan: \"While on holiday on Corfu, I went to a pond-hopping to photograph kingfishers but ended up shooting insects, which were much more abundant.\"\r\n</li><li>Dave Stewart: \"I don't actually know what the insect is. I'm assuming it's a moth. But i… [+1817 chars]"
    },
    {
        "title": "Exclusive: Postponed Tokyo 2020 Games could open door for drug cheats - USADA",
        "description": "The one year postponement of the 2020 Tokyo Olympics could open the door for convicted drug cheats to compete for medals, and is something that will need to addressed, United States Anti-Doping Agency (USADA) chief Travis Tygart told Reuters on Tuesday.",
        "content": "TORONTO (Reuters) - The one year postponement of the 2020 Tokyo Olympics could open the door for convicted drug cheats to compete for medals, and is something that will need to addressed, United States Anti-Doping Agency (USADA) chief Travis Tygart told Reute… [+250 chars]"
    },
    {
        "title": "Canada police arrest suspected gunman, say there have been several victims",
        "description": "Police in the Atlantic Canadian province of Nova Scotia on Sunday arrested a 51-year-old gunman who they said was suspected of shootings that had resulted in several victims.",
        "content": "OTTAWA (Reuters) - Police in the Atlantic Canadian province of Nova Scotia on Sunday arrested a 51-year-old gunman who they said was suspected of shootings that had resulted in several victims. \r\nThe Royal Canadian Mounted Police said the shootings occurred i… [+897 chars]"
    },
    {
        "title": "Oil skids on oversupply fears, U.S. stock futures jump",
        "description": "Oil prices skidded on Monday after Saudi-Russian output discussions showed no immediate signs of progress while U.S. stock futures jumped as investors were encouraged by a slowdown in coronavirus-related deaths and new cases.",
        "content": "SYDNEY (Reuters) - Oil prices skidded on Monday after Saudi-Russian output discussions showed no immediate signs of progress while U.S. stock futures jumped as investors were encouraged by a slowdown in coronavirus-related deaths and new cases. \r\nSterling GBP… [+2502 chars]"
    },
    {
        "title": "Warships returning, soldiers wait for call: Gen. Vance on COVID-19 preparations - CTV News",
        "description": "Warships returning, soldiers wait for call: Gen. Vance on COVID-19 preparations CTV News 85% of Canadian troops ordered into isolation to prepare for COVID-19 operations Global News Military ready to respond to outbreak of COVID-19 in isolated Indigenous and …",
        "content": "TORONTO -- \r\nCanada's top soldier says the Canadian Armed Forces is taking \"extraordinary\" measures to ensure its members are healthy and able to deploy quickly should a province or territory request help to fight an invisible enemy: COVID-19.\r\nThe majority o… [+3175 chars]"
    },
    {
        "title": "Being on the East Coast a double-edged sword in COVID-19 pandemic medical battle - ThoroldNews.com",
        "description": "HALIFAX — Being a small East Coast province in the pandemic is a double-edged sword: there are fewer critically ill patients, but the supply of hospital beds is limited if the worst-case scenario materializes.",
        "content": "HALIFAX Being a small East Coast province in the pandemic is a double-edged sword: there are fewer critically ill patients, but the supply of hospital beds is limited if the worst-case scenario materializes.\r\n\"We will have fewer beds, but we will have a lower… [+4933 chars]"
    },
    {
        "title": "Premier’s ‘delightfully Nova Scotian’ cry to respect physical distancing goes viral - Global News",
        "description": "Premier’s ‘delightfully Nova Scotian’ cry to respect physical distancing goes viral Global News Four people, business charged for violating COVID-19 rules in Nova Scotia CTV News Cases of COVID-19 rise to 236 in Nova Scotia CBC.ca Google Mobility Reports a sl…",
        "content": "One premiers war cry for citizens to respect physical distancing during the novel coronavirus pandemic has gone viral.\r\nThe call to “stay the blazes home” came on Friday during one of Nova Scotia’s daily press conferences.\r\nPremier Stephen McNeil spoke forcef… [+5028 chars]"
    },
    {
        "title": "Latest on the coronavirus: Man arrested for 'purposely coughing'; teen charged for faking COVID-19 - The Globe and Mail",
        "description": "Latest on the coronavirus: Man arrested for 'purposely coughing'; teen charged for faking COVID-19 The Globe and Mail 5 things to know on CTVNews.ca for Friday March 27, 2020: Virus scams, COVID-19 cases, Canada-US border CTV News View Full coverage on Google…",
        "content": "Latest headlines\r\n<ul><li>Bank of Canada cuts key interest rate half-percentage point to 0.25 per cent</li><li>Federal deficit to top $112-billion in coming fiscal year due to COVID-19 pandemic, PBO says</li><li>U.S. wont post troops at Canadian border</li><l… [+11631 chars]"
    },
    {
        "title": "Canadian police encourage tipsters while working on timeline of mass shooting",
        "description": "Canadian police on Thursday worked to piece together the timeline of a shooting spree that started in a rural hamlet in the Atlantic province of Nova Scotia and ended 13 hours later when the gunman, who killed 22 people, was shot dead. \"Anything you know – no…",
        "content": "By Tim Krochak and Moira Warburton\r\nPORTAPIQUE, Nova Scotia (Reuters) - Canadian police on Thursday worked to piece together the timeline of a shooting spree that started in a rural hamlet in the Atlantic province of Nova Scotia and ended 13 hours later when … [+2473 chars]"
    },
    {
        "title": "OrganiGram Holdings Reports Disappointing Fiscal Second-Quarter Results",
        "description": "The cannabis company’s shares plunged by almost 12% Tuesday on the heels of its earnings report.",
        "content": "After hitting it out of the park in the first quarter of its fiscal 2020, OrganiGram Holdings(NASDAQ:OGI) whiffed during the second. On Tuesday, the cannabis company released its quarterly update, reporting net revenue of 23.2 million Canadian dollars.\r\nThat … [+1722 chars]"
    },
    {
        "title": "You Won't Regret Adding $250 to These 4 Stocks Right Now",
        "description": "Even small investments can yield big rewards over time.",
        "content": "Let' be brutally honest: The past five-plus weeks have been especially trying as an investor.\r\nWhether you're a seasoned vet that's been investing for perhaps five decades or you've dipped your toes into the water for the first time within the past year, you'… [+7487 chars]"
    },
    {
        "title": "5 Top Stocks to Buy That Can Be 10-Baggers by 2030",
        "description": "Give these high-growth businesses 10 years, and they may reward you with a 1,000% gain.",
        "content": "What we're witnessing with regard to the spread of the coronavirus disease 2019 (COVID-19) is both unprecedented and tragic. Through Saturday, April 4, approximately 1.2 million cases of the coronavirus had been confirmed worldwide, with close to 65,000 peopl… [+7664 chars]"
    },
    {
        "title": "Take $100 and Open a Position in These 4 Stocks Now",
        "description": "This could be a once-in-a-generation opportunity to buy into great businesses at a discount.",
        "content": "Following years of a slow but steady climb for the stock market, Wall Street has been firmly reminded over the past 7 weeks that equities can, and will, move in both directions. Since Feb. 19, we've witnessed:\r\n<ul><li>The steepest decline into bear market te… [+6314 chars]"
    },
    {
        "title": "2 Best Pot Stocks to Buy and Hold for the Next 10 Years",
        "description": "Aphria and OrganiGram Holdings are among the most efficient companies in the legal cannabis industry.",
        "content": "Despite losing over half its value during the last three quarters of 2019, the legal marijuana industry hasn't exactly been a safe haven for investors during the COVID-19 pandemic. Several of the industries biggest names, in fact, have lost another third of t… [+4070 chars]"
    },
    {
        "title": "Nova Scotia tragedy joins grim list of Canadian mass shootings",
        "description": "The shootings in Nova Scotia, described by Premier Stephen McNeil as \"one of the most senseless acts of violence in our province's history,\" join a line of tragic and horrifying mass killings in Canada.",
        "content": "Canadians across the country were expressing grief and condolences Monday after killing of at least 18 people Sunday in Portapique, Enfield and other locations in central Nova Scotia.\r\nThe deaths, described by Premier Stephen McNeil as \"one of the most sensel… [+5257 chars]"
    },
    {
        "title": "See what life is like with lockdowns, social distancing and self-isolation in Canada and around the world",
        "description": "Everyday life for people in Canada and across the globe has suddenly become unrecognizable, with millions staying at home, practicing social distancing and self-isolating amid the COVID-19 pandemic. Everything from city streets and parks to restaurants, legis…",
        "content": "Scroll down for a look at how lockdowns, social distancing and self-isolation have changed daily life for people in Canada and in cities around the world. \r\nCanada's biggest city\r\nToronto is usually a bustling, thriving metropolis, but drone video taken from … [+4077 chars]"
    },
    {
        "title": "Canadian police encourage tipsters while working on timeline of mass shooting",
        "description": "Canadian police on Thursday worked to piece together the timeline of a shooting spree that started in a rural hamlet in the Atlantic province of Nova Scotia and ended 13 hours later when the gunman, who killed 22 people, was shot dead.",
        "content": "PORTAPIQUE, Nova Scotia (Reuters) - Canadian police on Thursday worked to piece together the timeline of a shooting spree that started in a rural hamlet in the Atlantic province of Nova Scotia and ended 13 hours later when the gunman, who killed 22 people, wa… [+2449 chars]"
    },
    {
        "title": "She's the most prominent woman in Canada and leading the country's fight against COVID-19",
        "description": "Chrystia Freeland has been called Canada's 'minister of everything,' in charge of the country's battle against the coronavirus and designated as Prime Minister Justin Trudeau's successor if he falls ill.",
        "content": "Canadian Deputy Prime Minister Chrystia Freeland is \"the star of the moment,\" one observer said. (Brett Gundlock / Getty Images)\r\nLast fall, Prime Minister Justin Trudeau named her deputy prime minister and charged her with ameliorating relations between Otta… [+13370 chars]"
    },
    {
        "title": "Organigram Receives Health Canada License Renewal and Expansion for Final Elements of Phase 5 and Provides COVID-19 Update",
        "description": "MONCTON, New Brunswick--(BUSINESS WIRE)---- $OGI--Organigram Holdings Inc. (NASDAQ: OGI) (TSX: OGI), the parent company of Organigram Inc. (the “Company” or “Organigram”), a leading licensed producer of cannabis, is pleased to announce that the Company has re…",
        "content": "MONCTON, New Brunswick--(BUSINESS WIRE)--Organigram Holdings Inc. (NASDAQ: OGI) (TSX: OGI), the parent company of Organigram Inc. (the Company or Organigram), a leading licensed producer of cannabis, is pleased to announce that the Company has received Health… [+5592 chars]"
    },
    {
        "title": "Organigram Provides Update on Corporate Action Plan in Response to COVID-19 Pandemic",
        "description": "MONCTON, New Brunswick--(BUSINESS WIRE)---- $OGI--Organigram Holdings Inc. (NASDAQ: OGI) (TSX: OGI), the parent company of Organigram Inc. (the “Company” or “Organigram”), a leading licensed producer of cannabis, today announced the temporary layoff of approx…",
        "content": "MONCTON, New Brunswick--(BUSINESS WIRE)--Organigram Holdings Inc. (NASDAQ: OGI) (TSX: OGI), the parent company of Organigram Inc. (the Company or Organigram), a leading licensed producer of cannabis, today announced the temporary layoff of approximately 45 pe… [+9284 chars]"
    },
    {
        "title": "Organigram Holdings Inc. Announces At-The-Market Equity Program",
        "description": "MONCTON, New Brunswick--(BUSINESS WIRE)---- $OGI--Organigram Holdings Inc. (“Organigram” or the “Corporation”) (TSX:OGI) (NASDAQ:OGI) announced today that it has established an at-the-market equity program (the “ATM Program”) that allows the Corporation to is…",
        "content": "MONCTON, New Brunswick--(BUSINESS WIRE)--Organigram Holdings Inc. (Organigram or the Corporation) (TSX:OGI) (NASDAQ:OGI) announced today that it has established an at-the-market equity program (the ATM Program) that allows the Corporation to issue up to C$49,… [+6655 chars]"
    },
    {
        "title": "Organigram Reports Second Quarter Fiscal 2020 Results",
        "description": "MONCTON, New Brunswick--(BUSINESS WIRE)---- $OGI--Organigram Holdings Inc. (NASDAQ: OGI) (TSX: OGI), the parent company of Organigram Inc. (together, the “Company” or “Organigram”), a leading licensed producer of cannabis, is pleased to announce its results f…",
        "content": "MONCTON, New Brunswick--(BUSINESS WIRE)--Organigram Holdings Inc. (NASDAQ: OGI) (TSX: OGI), the parent company of Organigram Inc. (together, the Company or Organigram), a leading licensed producer of cannabis, is pleased to announce its results for the second… [+32011 chars]"
    },
    {
        "title": "Consumer Research Drives Enhancements to Organigram Adult Recreational Commercial Portfolio",
        "description": "MONCTON, New Brunswick--(BUSINESS WIRE)---- $OGI--Organigram Holdings Inc. (NASDAQ: OGI) (TSX: OGI), the parent company of Organigram Inc. (the “Company” or “Organigram”), a leading licensed producer of cannabis, is pleased to provide an update related to the…",
        "content": "MONCTON, New Brunswick--(BUSINESS WIRE)--Organigram Holdings Inc. (NASDAQ: OGI) (TSX: OGI), the parent company of Organigram Inc. (the Company or Organigram), a leading licensed producer of cannabis, is pleased to provide an update related to the Companys cur… [+6310 chars]"
    },
    {
        "title": "Let's call the Nova Scotia mass shooting what it is: White male terrorism",
        "description": "Until we acknowledge that toxic white masculinity is fuelling mass murders, aggrieved white men will continue to commit them -- and we'll all continue to pay the price.",
        "content": "A man and his son pay respects at a memorial to a teacher in Debert, N.S. on April 21, 2020. RCMP say at least 23 people are dead after a man went on a murder rampage in Nova Scotia communities. THE CANADIAN PRESS/Andrew Vaughan\r\nWhile the mainstream media ha… [+6412 chars]"
    }
]